[
  {
    "id": 10,
    "imageURL": "./assets/RAPPACIFICO.png",
    "title": "RAP Pacífico",
    "css": "md:col-span-2",
    "description": "RAP Pacifico is a platform where agencies can sell services or tour packages as an ecommerce, especially tourism on the Colombian Pacific.",
    "descriptionLarge": "In this project I worked as Javascript Backend Developer, my task was to create new services to send information to the website using node and Express, I connected the payment gateway, created a flow to allow the user to buy some service as a guest and finally I corrected and improved some queries and services to improve the user experience. I enabled email notifications and redesigned these email templates. Also I create new frontend views in NextJS and integrate them with the backend.",
    "skills": ["Nodejs", "Express", "Typescript", "Microservices"],
    "repository": "",
    "liveDemoUrl": "https://portal.pacificocolombia.com/",
    "ui": null,
    "isVisible": true
  },
  {
    "id": 1,
    "imageURL": "./assets/SMAPP.png",
    "title": "SMAPP",
    "css": "",
    "description": "It is an internal company app that allows you to create loans, and manage them, it also has a dashboard that shows the loans you have created, the amount of money you have borrowed, the interest rate, the duration of the loan, and the date of the loan, finally you can collect those loans, register new customers and report visits.",
    "descriptionLarge": "In this project I worked as React Native Developer and UI Designer, my task was to design all the UI, and develop all the business logic of the application, I used graphql to manage some data and API Rest to get information from the backend and Redux to store the state and Typescript to manage the code.",
    "skills": [
      "React Native",
      "Redux",
      "GraphQL",
      "Axios",
      "Figma",
      "Typescript",
      "React Native Navigation"
    ],
    "repository": "",
    "liveDemoUrl": "",
    "ui": "./assets/ui-smapp.png",
    "isVisible": true
  },

  {
    "id": 8,
    "imageURL": "./assets/LEWIS-NOGUERA.png",
    "title": "Portfolio Lewis",
    "css": "",
    "description": "I Designed and developed this website completely in Vue3 and Tailwindcss, I used figma to design the whole website.",
    "descriptionLarge": "This project was built from Vue3 and Tailwindcss. I designed the whole website in figma and then developed it to code.",
    "skills": ["Vue", "TailwindCss", "Typescript", "Vite", "Vue-Router"],
    "repository": "https://github.com/LewisFNoguera/portfolio-lewis-noguera",
    "liveDemoUrl": "",
    "ui": null,
    "isVisible": true
  },
  {
    "id": 2,
    "imageURL": "./assets/monetta.png",
    "title": "Monetta",
    "css": "",
    "description": "Monetta is a Fintech SuperApp with an integrated multi-currency digital wallet, and it's own payment method based on tokens that allows people to access a wide portfolio of goods and services in a complete ecosystem with the latest products from Nike, Amazon USA, Sephora or Ralph Lauren, digital services like mobile and sports betting top-ups and financial solutions like Monetta's debit card, among others.",
    "descriptionLarge": "In this project I worked creating the UI of the CMS and the mobile App, I also participated in the frontend development in React for the CMS, creating modules, passing the design to code, the same with the mobile app, additionally I supported the backend team creating API services for both platforms.",
    "skills": ["React Native", "Redux", "Axios", "React", "TailwindCss", "NestJs"],
    "repository": "",
    "liveDemoUrl": "https://play.google.com/store/apps/details?id=com.monetta ",
    "ui": "./assets/ui-monetta.png",
    "isVisible": true
  },
  {
    "id": 4,
    "imageURL": "./assets/OWO.png",
    "title": "OWO tech",
    "css": "",
    "description": "OWO is a mobile platform for the sale of digital services or products.",
    "descriptionLarge": "I worked on this project designing the UI partially of the mobile app and in the design and frontend development of the administrative CMS in Angular.",
    "skills": ["React Native", "Redux", "Angular", "Axios"],
    "repository": "",
    "liveDemoUrl": "https://play.google.com/store/apps/details?id=owo.com.co&hl=es_CO&gl=US",
    "ui": "./assets/uiowo.png",
    "isVisible": true
  },
  {
    "id": 5,
    "imageURL": "./assets/DAVIPLATA.png",
    "title": "Daviplata Map",
    "css": "",
    "description": "It is a map that allows the user to find points of service of the Bank: ATMs, banking correspondents or points of attention.",
    "descriptionLarge": "In this project I worked as Frontend Developer and UI Designer, my task was to add improvements in the UI of certain components for this I presented designs in Figma for approval and subsequent implementation in Angular.",
    "skills": ["Angular", "Figma"],
    "repository": "",
    "liveDemoUrl": "https://prod.daviviendaapp.com/#/1580911510000",
    "ui": null,
    "isVisible": true
  },
  {
    "id": 6,
    "imageURL": "./assets/DAVIVIENDA.png",
    "title": "Davivienda Map",
    "css": "",
    "description": "It is a map that allows the user to find points of service of the Bank: ATMs, banking correspondents or points of attention.",
    "descriptionLarge": "In this project I worked as Frontend Developer and UI Designer, my task was to add improvements in the UI of certain components for this I presented designs in Figma for approval and subsequent implementation in Angular.",
    "skills": ["Angular", "Figma"],
    "repository": "",
    "liveDemoUrl": "https://www.davivienda.com/wps/portal/personas/nuevo#iframe",
    "ui": null,
    "isVisible": true
  },
  {
    "id": 7,
    "imageURL": "./assets/ADATEC.png",
    "title": "R-SALES (Adatec S.A.S)",
    "css": "",
    "description": "R-SALES (Remote Sales) is a service developed to optimize and monetize the operation of companies with any type of field personnel. The service allows to streamline the processes in the field and audit their correct execution.",
    "descriptionLarge": "In this project I worked as Frontend Developer and UI Designer, my task was to add improvements in the UI of certain components for this I presented designs in Figma for approval and subsequent implementation in SenchaTouch, in addition to design and develop the company's website and administrative portals..",
    "skills": ["SenchaTouch", "Figma", "Wordpress"],
    "repository": "",
    "liveDemoUrl": "https://adatec.co/r-sales/",
    "ui": null,
    "isVisible": true
  },
  {
    "id": 3,
    "imageURL": "./assets/MDINTELLIGENCE.png",
    "title": "MDIntelligence",
    "css": "",
    "description": "Landing page design and coding for a software development company.",
    "descriptionLarge": "For this project I did all the UI design in figma and its later implementation in Astro and Tailwind css. ",
    "skills": ["Astro", "TailwindCss"],
    "repository": "https://github.com/LewisFNoguera/mdinteliigence",
    "ui": null,
    "liveDemoUrl": "",
    "isVisible": true
  }
]
